fixed_choices = {
    "어댑터 패턴": [
        "어댑터 패턴",
        "브릿지 패턴",
        "체인 패턴",
    ],
    
    "브릿지 패턴": [
        "어댑터 패턴",
        "브릿지 패턴",
        "체인 패턴",
    ],

    "체인 패턴": [
        "어댑터 패턴",
        "브릿지 패턴",
        "체인 패턴",
    ],
    
    "상태 패턴": [
        "상태 패턴",
        "옵저버 패턴",
        "전략 패턴",
        "중재자 패턴",
    ],

    "앱스트랙트 팩토리 패턴": [
        "앱스트랙트 팩토리 패턴",
        "빌더 패턴",
        "팩토리 메서드 패턴",
        "프로토타입 패턴",
    ],

    "템플릿 패턴": [
        "템플릿 패턴",
        "팩토리 메서드 패턴",
        "앱스트랙트 팩토리 패턴",
        "전략 패턴",
    ],

    "메멘토 패턴": [
        "메멘토 패턴",
        "커맨드 패턴",
    ],

    "커맨드 패턴": [
        "커맨드 패턴",
        "메멘토 패턴",
    ],
}